app/controllers/sessions_controller.rb

	def callback
		#omniauth.auth環境変数を取得
		auth = request.env["omniauth.auth"]
		#omniuserモデルを検索
		omniuser = Omniuser.find_by_provider_and_uid(auth["provider"], auth["uid"])

		if omniuser
			#外部認証済みの場合、ログイン
			session[:user_id] = omniuser.id
			redirect_to user_root_url, :notice => "ログインしました。"
		else
			Omniuser.create_with_omniauth(auth)
---
SELECT `omniusers`.* FROM `omniusers` WHERE `omniusers`.`provider` = 'facebook' AND `omniusers`.`uid` = '100002836190980' LIMIT 1
INSERT INTO `omniusers` (`created_at`, `email`, `image`, `name`, `provider`, `uid`, `updated_at`) VALUES ('2013-05-10 16:18:34', NULL, NULL, 'parce_que_je_vis@ezweb.ne.jp', 'facebook', '100002836190980', '2013-05-10 16:18:34')